# DataFrames

In [1]:
import numpy as np
import pandas as pd

In [2]:
fila = ['ventas1','ventas2','ventas3']
columnas= ['zonaA','zonaB','zonaC']
datos= [[123,421,256],[234,541,257],[120,451,258]]
#Se crea una matriz de 3x3

In [4]:
dataframe= pd.DataFrame(datos,fila,columnas)
#En este orden se construye el DataFrame
print(dataframe)

         zonaA  zonaB  zonaC
ventas1    123    421    256
ventas2    234    541    257
ventas3    120    451    258

In [8]:
dataframe.loc[['ventas1','ventas2']] #seleeciona las filas seleccionadas

         zonaA  zonaB  zonaC
ventas1    123    421    256
ventas2    234    541    257

In [9]:
dataframe['zonaA'] #Seleccionas columnas

ventas1    123
ventas2    234
ventas3    120
Name: zonaA, dtype: int64

In [10]:
dataframe[['zonaA','zonaB']] #Seleccionar varias columnas

         zonaA  zonaB
ventas1    123    421
ventas2    234    541
ventas3    120    451

In [12]:
dataframe.loc['ventas1']['zonaA']#Seleccionar un valor en especifico

123

In [15]:
#Agregar columnas
dataframe['Todas las zonas']= dataframe['zonaA']+dataframe['zonaB']+dataframe['zonaC']

In [29]:
dataframe

         zonaA  zonaB  zonaC
ventas1    123    421    256
ventas2    234    541    257

In [18]:
#Borrar en la visualizacion Columnas
dataframe.drop('Todas las zonas',axis=1)

         zonaA  zonaB  zonaC
ventas1    123    421    256
ventas2    234    541    257
ventas3    120    451    258

In [19]:
#Borrar definitivamente Columnas
dataframe.drop('Todas las zonas',axis=1, inplace=True)

In [20]:
dataframe

         zonaA  zonaB  zonaC
ventas1    123    421    256
ventas2    234    541    257
ventas3    120    451    258

In [21]:
#Borrar fila en la visualizacion
dataframe.drop('ventas3')

         zonaA  zonaB  zonaC
ventas1    123    421    256
ventas2    234    541    257

In [25]:
#Borrar fila permanentemente
dataframe.drop('ventas3',axis=0,inplace=True)

In [26]:
dataframe

         zonaA  zonaB  zonaC
ventas1    123    421    256
ventas2    234    541    257

In [33]:
#Ver tamaño que tiene el DataFrame
dataframe.shape

(2, 3)